Repository: clemvalla/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/explorer.po
Languages: fr

source: The world glacier explorer is an **interactive web application** with which you can learn (and teach) about the world's glaciers, their location, their climate, and the ice they store. By "glaciers", we mean all glaciers outside of the two continental ice sheets (Greenland and Antarctica).
fr: Le world glacier explorer est une **application web interactive** avec laquelle vous pourrez en apprendre d'avantage (et enseigner) sur les glaciers du monde, leur localisation, leur climat et le volume de glace qu'ils stockent. Par "glaciers", nous entendons tous les glaciers en dehors des deux calottes glaciaires continentales (Groenland et Antarctique).

source: You can start the app by clicking on this link: |badge_bokeh_en|_
fr: Vous pouvez lancer l'application en cliquant sur ce lien : |badge_bokeh_fr|_

source: Alternatively, you can start the app `on mybinder <https://mybinder.org/v2/gh/OGGM/world-glacier-explorer/master?urlpath=panel/app>`_ (slightly slower in general, but a good alternative if our server is saturated). If you want to run the app on your own computer, see :ref:`docker-launch` below.
fr: Vous pouvez également lancer l'application `sur mybinder <https://mybinder.org/v2/gh/OGGM/world-glacier-explorer/master?urlpath=panel/app>`_ (légèrement plus lent en général, mais constitue une bonne alternative si notre serveur est saturé). Si vous souhaitez exécuter l'application sur votre propre ordinateur, voyez :ref:`docker-launch` ci-dessous.

source: **The app contains five elements**:
fr: **L'application contient cinq éléments** :

source: the **world map** (upper right) displays thg glaciers' location, with the color shading indicating the total glacier area in each pixel. Moving the mouse over a glacier pixel displays its exact glaciated area. When selecting a box on the map, the other elements in the app will update accordingly. Above the map, there is a toolbar: with the "Box Zoom" button, you can also zoom into a specific region. Click on "Reset" to set the map back to defaults (see the video below for a demo). *Be aware that the map projection is slightly misleading: high latitudes appear much bigger on the map than they really are.*
fr: La **carte du monde** (en haut à droite) montre l'emplacement des glaciers, leur couleur indiquant la surface glaciaire totale dans chaque pixel. Déplaçer la souris sur un pixel de glacier permet d'afficher sa surface glaciaire exacte. Lorsque vous sélectionnez une case sur la carte, les autres éléments de l'application sont mis à jour en conséquence. Au-dessus de la carte se trouve une barre d'outils : avec l'icône "Zoom", vous pouvez également zoomer sur une région spécifique. Cliquez sur "Réinitialiser" pour rétablir les paramètres par défaut (voir la vidéo ci-dessous pour une démonstration). *Sachez que la projection de la carte est légèrement trompeuse : les hautes latitudes apparaissent beaucoup plus grandes sur la carte qu'elles ne le sont réellement.*

source: the **clear selection button** on the left resets the current glacier selection.
fr: le bouton **clear selection** à gauche de l'écran réinitialise la sélection

source: the **bar plots** (left of the map) indicate various statistics about the current glacier selection (default selection: all glaciers). The upper blue bar indicates the number of glaciers selected, the middle blue bar their total area, and the lower blue bar their estimated volume. This volume can be converted to its *sea-level rise equivalent* (in mm), which is the global sea-level rise to be expected if all glacier vanished. Only glaciers *above* sea-level are contributing to this figure, therefore there are two vertical orange bars: *asl* (above sea-level) and *bsl* (below sea-level). See the demo and explanations below on how to use this information.
fr: les **diagrammes en batons** (à gauche de la carte) présentent plusieurs statistiques sur les glaciers sélectionnés (sélection par défaut : tous les glaciers). La barre bleue supérieure indique le nombre de glaciers sélectionnés, la barre bleue centrale indique leur superficie totale, et la barre bleue inférieure leur volume estimé. Ce volume peut être converti en son *équivalent en élévation du niveau de la mer* (en mm), qui est l'élévation globale du niveau de la mer à laquelle on peut s'attendre si tous les glaciers sélectionnés viennent à disparaître. Seuls les glaciers *au dessus* du niveau de la mer contribuent à cette figure, il y a donc deux barres verticales orange : *asl* (au-dessus du niveau de la mer) et *bsl* (sous le niveau de la mer). Voir la démonstration et les explications ci-dessous sur la façon d' utiliser ces informations.

source: the three **climate histograms plots** (lower row) display the distribution of the selected glaciers' climate conditions. The y-axis is given in number of glaciers per bin, and the x-axis in the unit of the target variable (temperature trend, average temperature, average precipitation at the glacier location). Selecting a range of values in these plots also actualizes the map and the rest of the plots (see demo below).
fr: les trois **histogrammes climatiques** (ligne du bas) représentent la distribution des conditions climatiques des glaciers sélectionnés. Les valeurs sur l'axe des ordonnées correspondent au nombre de glaciers par case. Les valeurs de l'axe des abscisses sont données dans l'unité de la variable cible (tendance de température, température moyenne, précipitations moyennes à l'emplacement du glacier). La sélection d'une plage de valeurs dans ces parcelles actualise également la carte et le reste des parcelles (voir la démo ci-dessous).

source: the **glacier elevation/latitude scatter plot** (lower right) displays the average elevation of the glaciers on the map as a function of latitude (y-axis).
fr: Le **diagramme de dispersion altitude/latitude des glaciers** (en bas à droite) affiche l'altitude moyenne des glaciers sur la carte en fonction de de leur latitude (axe des ordonnées).

source: Video tutorials
fr: Tutoriels vidéos

source: Part 1: app functionalities
fr: Partie 1 : fonctionnalités de l'application

source: Part 2: example questions
fr: Partie 2 : exemples de questions

source: Questions to explore with this app
fr: Questions à approfondir avec cette application

source: With this app, you can address many questions, by yourself or in class! For example:
fr: Avec cette application, vous pouvez répondre à de nombreuses questions, seul ou en classe ! Par exemple :

source: How many glaciers are there on Earth? How much volume do they represent?
fr: Combien de glaciers y a-t-il sur la Terre ? Quel volume représentent-ils ?

source: How much would the sea-level rise if all glaciers melted? All glaciers in the Alps? In the Himalayas? etc.
fr: De combien de mètres le niveau de la mer augmenterait-il si tous les glaciers fondaient ? Tous les glaciers des Alpes ? Tous les glaciers d'Himalaya ? etc.

source: What is the relationship between latitude and glacier elevation? Why?
fr: Quelle est la relation entre la latitude et l'altitude des glaciers ? Pourquoi ?

source: Where are the locations with highest precipitation? And the driests?
fr: Quels sont les endroits avec les plus fortes précipitations ? Et les plus secs ?

source: Is there a relationship between average temperature and average precipitation?
fr: Y a-t-il une relation entre la température moyenne et la moyenne des précipitations ?

source: How much glacier area is found on Greenland? In the European Alps? How does these number compare to, say, the area of Berlin, France, Mexico?
fr: Quelle superficie de glacier trouve-t-on au Groenland ? Dans les Alpes ? Que représentent ces surfaces par rapport à la superficie de Berlin, de la France, du Mexique ?

source: Does the number of glaciers in a region always correlate with their total volume?
fr: Le nombre de glaciers dans une région est-il toujours corrélé avec leur volume ?

source: What regions are most likely to contribute to sea-level rise? Where do we find glaciers with ice below sea-level?
fr: Quelles régions sont les plus susceptibles de contribuer à l'élévation du niveau de la mer ? Où trouve-t-on des glaciers avec de la glace sous le niveau de la mer ?

source: Where are the glaciers which are warming the fastest? Why?
fr: Où sont les glaciers qui se réchauffent le plus rapidement ? Pourquoi ?

source: Where are the wettest glaciers in the Himalayas? (select all Himalayan glaciers first, then the wettest). Can you explain why?
fr: Où se trouvent les glaciers les plus arrosés de l'Himalaya ? (sélectionnez d'abord tous les glaciers de l'Himalaya , puis les plus humides). Pouvez-vous expliquer pourquoi ?

source: Repeat the excercise above with other regions: Greenland, the Alps, etc.
fr: Répétez l'exercice ci-dessus avec d'autres régions : le Groenland, les Alpes, etc.

source: And many more!
fr: Et bien d'autres encore !

source: Resources
fr: Ressources

source: Several pages from `Glaciers and Climate <http://www.antarcticglaciers.org/glaciers-and-climate/>`_ on `antarcticglaciers.org`_ are highly relevant here
fr: Plusieurs pages de `Glaciers and Climate <http://www.antarcticglaciers.org/glaciers-and-climate/>`_ sur `antarcticglaciers.org`_ sont pertinentes ici

source: `Warming trends at glaciers locations <https://fabienmaussion.info/2019/08/29/era5/>`_, a blog post by Fabien Maussion
fr: `Warming trends at glaciers locations <https://fabienmaussion.info/2019/08/29/era5/>`_, un blog de Fabien Maussion

source: Authors
fr: Auteurs

source: `Philipp Rudiger <https://github.com/philippjfr>`_ and `James Bednar <https://github.com/jbednar>`_ from `HoloViz <http://holoviz.org//>`_ and Anaconda Inc., based on an original Dash application by `Fabien Maussion <https://fabienmaussion.info/>`_. `Zora Schirmeister <https://github.com/zschirmeister>`_ improved the app with new data, plots, and an improved layout.
fr: `Philipp Rudiger <https://github.com/philippjfr>`_ et `James Bednar <https://github.com/jbednar>`_ de `HoloViz <http://holoviz.org//>`_ et Anaconda Inc., basés sur une *Dash application* originale de `Fabien Maussion <https://fabienmaussion.info/>`_. `Zora Schirmeister <https://github.com/zschirmeister>`_ a amélioré l'application avec de nouvelles données, des graphiques, et une meilleure mise en page.

source: Data sources
fr: Sources des données

source: Glacier location, elevation and area are obtained from the `Randolph Glacier Inventory version 6 <https://www.glims.org/RGI/>`_. The climate data (temperature, precipitation, trends) is extracted from `ERA5 data <https://www.ecmwf.int/en/forecasts/datasets/reanalysis-datasets/era5>`_ provided by the `ECMWF <https://www.ecmwf.int/>`_. The glacier volume was provided by `Farinotti et al., (2019) <https://www.nature.com/articles/s41561-019-0300-3>`_
fr: L'emplacement, l'altitude et la superficie des glaciers sont obtenus à partir du `Randolph Glacier Inventory version 6 <https://www.glims.org/RGI/>`_. Les données climatiques (température, précipitations, tendances) sont extraites des données `ERA5 data <https://www.ecmwf.int/en/forecasts/datasets/reanalysis-datasets/era5>`_ fournies par le `ECMWF <https://www.ecmwf.int/>`_. Le volume des glaciers a été fourni par `Farinotti et al. (2019) <https://www.nature.com/articles/s41561-019-0300-3>`_

source: Source code
fr: Code source

source: Code and data are on `GitHub <https://github.com/OGGM/world-glacier-explorer>`_, MIT licensed.
fr: Le code et les données sont sur `GitHub <https://github.com/OGGM/world-glacier-explorer>`_, sous licence MIT.

source: Launching from Docker
fr: Lancement à partir de Docker

source: This application should work quite well online, either on our server or on mybinder. But you can also start the app locally, which will make it faster and less dependent on an internet connection (although you still need one to download the app, display the logos and the map).
fr: Cette application devrait relativement bien fonctionner en ligne, que ce soit sur notre serveur ou sur mybinder. Mais vous pouvez également lancer l'application en local, ce qui la rendra plus rapide et moins dépendante d'une connexion internet (bien que vous en ayez toujours besoin pour télécharger l'application, afficher les logos et la carte).

source: To start the app locally, all you'll need is to have `Docker <https://www.docker.com/>`_ installed on your computer. From there, run this command into a terminal::
fr: Pour lancer l'application en local, il vous suffit d'avoir `Docker <https://www.docker.com/>`_ installé sur votre ordinateur. Vous pouvez ensuite exécuter cette commande dans un terminal :

source: Once running, you should be able to start the app in your browser at this address: `http://127.0.0.1:8080/ <http://127.0.0.1:8080/>`_.
fr: Une fois Docker lancé, vous devriez pouvoir démarrer l'application dans votre navigateur à cette adresse : `http://127.0.0.1:8080/ <http://127.0.0.1:8080/>`_.

source: Possible future improvements
fr: Possibles améliorations futures

source: With a category choice bar, it would be possible to differentiate glaciers from ice-caps or marine terminating glaciers from land-terminating ones.
fr: Avec une barre permettant de choisir différentes catégories, il serait possible de différencier les glaciers des calottes glaciaires ou les glaciers terminant dans l'océan, des glaciers terrestres.

source: We could also simplify the app for younger target audiences, with less panels and less distraction.
fr: Nous pourrions également simplifier l'application pour un public plus jeune, avec moins panneaux et moins de distraction.
